Revit 2024 API
FabricWireItem Class
 Provides implementation for FabricWires stored in a Custom Fabric Sheet
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public class FabricWireItem : IDisposable
Visual Basic
Public Class FabricWireItem _
	Implements IDisposable
Visual C++
public ref class FabricWireItem : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.FabricWireItem
See Also
FabricWireItem Members
Autodesk.Revit.DB.Structure Namespace